<!-- dflook/terraform-github-actions {"workspace":"opentofu","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"317ed68fcfde921962d44cc5bf3dba728fe749dee2caf77808eb83ca11f7ecc4","plan_job_ref":"Job Test plan target and replace #356 at https://github.com/dflook/terraform-github-actions/actions/runs/6592484850","plan_hash":"a966c9a15b50e72b688550ccf75d0a304ef4b45a79f7578dc2adbf9a76f26b1d","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __opentofu__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "Bb568cFuXl" -> (known after apply)
  ~ foreach = "yy2g36fO7T" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #356](https://github.com/dflook/terraform-github-actions/actions/runs/6592484850)